MobiSys2006/multihop/results Folder/logs_OD_2 6.21/httperf_log
Kernel IP routing table
Destination     Gateway         Genmask         Flags Metric Ref    Use Iface
1.248.64.31     1.248.64.31     255.255.255.255 UGH   0      0        0 br0
1.70.18.140     1.188.212.31    255.255.255.255 UGH   0      0        0 br0
1.93.105.236    1.188.212.31    255.255.255.255 UGH   0      0        0 br0
1.188.212.31    1.188.212.31    255.255.255.255 UGH   0      0        0 br0
10.125.208.226  10.125.208.226  255.255.255.255 UGH   0      0        0 br1
172.16.232.1    *               255.255.255.255 UH    0      0        0 tun0
1.241.56.218    1.241.56.218    255.255.255.255 UGH   0      0        0 br0
192.168.1.0     *               255.255.255.0   U     0      0        0 eth0
192.168.199.0   *               255.255.255.0   U     0      0        0 br1
192.168.232.0   *               255.255.255.0   U     0      0        0 br0
1.0.0.0         *               255.0.0.0       U     0      0        0 br0
1.0.0.0         *               255.0.0.0       U     0      0        0 br1
1.0.0.0         *               255.0.0.0       U     0      0        0 br0
10.0.0.0        *               255.0.0.0       U     0      0        0 br0
10.0.0.0        *               255.0.0.0       U     0      0        0 br1
loopback        *               255.0.0.0       U     0      0        0 lo
base-address.mc *               240.0.0.0       U     0      0        0 br0
default         172.16.232.1    0.0.0.0         UG    0      0        0 tun0
====== 10 USERS ==========
httperf --client=0/1 --server=www.google.com --port=80 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=30 --num-calls=1
Maximum connect burst length: 1

Total: connections 30 requests 30 replies 30 test-duration 2.941 s

Connection rate: 10.2 conn/s (98.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 77.8 avg 98.0 max 174.6 median 89.5 stddev 26.5
Connection time [ms]: connect 40.7
Connection length [replies/conn]: 1.000

Request rate: 10.2 req/s (98.0 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 55.9 transfer 1.4
Reply size [B]: header 302.0 content 1991.0 footer 2.0 (total 2295.0)
Reply status: 1xx=0 2xx=30 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.57 system 2.32 (user 19.4% system 78.9% total 98.3%)
Net I/O: 23.5 KB/s (0.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
====== 20 USERS ==========
httperf --client=0/1 --server=www.google.com --port=80 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=60 --num-calls=1
Maximum connect burst length: 1

Total: connections 60 requests 60 replies 60 test-duration 9.320 s

Connection rate: 6.4 conn/s (155.3 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 78.0 avg 155.3 max 3087.4 median 91.5 stddev 386.9
Connection time [ms]: connect 42.4
Connection length [replies/conn]: 1.000

Request rate: 6.4 req/s (155.3 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 4.0 avg 4.0 max 4.0 stddev 0.0 (1 samples)
Reply time [ms]: response 110.4 transfer 2.5
Reply size [B]: header 302.0 content 1991.0 footer 2.0 (total 2295.0)
Reply status: 1xx=0 2xx=60 3xx=0 4xx=0 5xx=0

CPU time [s]: user 1.95 system 7.22 (user 20.9% system 77.5% total 98.4%)
Net I/O: 14.8 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
====== 30 USERS ==========
httperf --client=0/1 --server=www.google.com --port=80 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=90 --num-calls=1
Maximum connect burst length: 1

Total: connections 90 requests 90 replies 90 test-duration 9.119 s

Connection rate: 9.9 conn/s (101.3 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 70.4 avg 101.3 max 200.0 median 90.5 stddev 26.8
Connection time [ms]: connect 42.8
Connection length [replies/conn]: 1.000

Request rate: 9.9 req/s (101.3 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 9.8 avg 9.8 max 9.8 stddev 0.0 (1 samples)
Reply time [ms]: response 56.4 transfer 2.1
Reply size [B]: header 302.0 content 1991.0 footer 2.0 (total 2295.0)
Reply status: 1xx=0 2xx=90 3xx=0 4xx=0 5xx=0

CPU time [s]: user 2.09 system 6.86 (user 22.9% system 75.2% total 98.2%)
Net I/O: 22.7 KB/s (0.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
====== 40 USERS ==========
httperf --client=0/1 --server=www.google.com --port=80 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=120 --num-calls=1
Maximum connect burst length: 1

Total: connections 120 requests 120 replies 120 test-duration 11.664 s

Connection rate: 10.3 conn/s (97.2 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 77.6 avg 97.2 max 271.4 median 87.5 stddev 27.4
Connection time [ms]: connect 43.4
Connection length [replies/conn]: 1.000

Request rate: 10.3 req/s (97.2 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 10.0 avg 10.3 max 10.6 stddev 0.4 (2 samples)
Reply time [ms]: response 52.5 transfer 1.3
Reply size [B]: header 302.0 content 1991.0 footer 2.0 (total 2295.0)
Reply status: 1xx=0 2xx=120 3xx=0 4xx=0 5xx=0

CPU time [s]: user 2.83 system 8.57 (user 24.3% system 73.5% total 97.7%)
Net I/O: 23.7 KB/s (0.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
====== 50 USERS ==========
httperf --client=0/1 --server=www.google.com --port=80 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=150 --num-calls=1
Maximum connect burst length: 1

Total: connections 150 requests 150 replies 150 test-duration 21.252 s

Connection rate: 7.1 conn/s (141.7 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 77.6 avg 141.7 max 3094.6 median 89.5 stddev 345.3
Connection time [ms]: connect 62.8
Connection length [replies/conn]: 1.000

Request rate: 7.1 req/s (141.7 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 3.4 avg 7.4 max 10.0 stddev 3.0 (4 samples)
Reply time [ms]: response 76.6 transfer 2.3
Reply size [B]: header 302.0 content 1991.0 footer 2.0 (total 2295.0)
Reply status: 1xx=0 2xx=150 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.75 system 15.77 (user 22.4% system 74.2% total 96.6%)
Net I/O: 16.3 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
====== 60 USERS ==========
httperf --client=0/1 --server=www.google.com --port=80 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=180 --num-calls=1
Maximum connect burst length: 1

Total: connections 180 requests 180 replies 180 test-duration 33.489 s

Connection rate: 5.4 conn/s (186.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 72.9 avg 186.0 max 9079.2 median 91.5 stddev 737.7
Connection time [ms]: connect 59.8
Connection length [replies/conn]: 1.000

Request rate: 5.4 req/s (186.0 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 0.0 avg 4.8 max 9.4 stddev 3.0 (6 samples)
Reply time [ms]: response 124.1 transfer 2.2
Reply size [B]: header 302.0 content 1991.0 footer 2.0 (total 2295.0)
Reply status: 1xx=0 2xx=180 3xx=0 4xx=0 5xx=0

CPU time [s]: user 7.19 system 25.71 (user 21.5% system 76.8% total 98.2%)
Net I/O: 12.4 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
====== 70 USERS ==========
httperf --client=0/1 --server=www.google.com --port=80 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=210 --num-calls=1
Maximum connect burst length: 1

Total: connections 210 requests 210 replies 210 test-duration 23.475 s

Connection rate: 8.9 conn/s (111.8 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 59.8 avg 111.8 max 3097.6 median 90.5 stddev 210.4
Connection time [ms]: connect 55.8
Connection length [replies/conn]: 1.000

Request rate: 8.9 req/s (111.8 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 4.6 avg 8.6 max 10.4 stddev 2.7 (4 samples)
Reply time [ms]: response 54.0 transfer 2.0
Reply size [B]: header 302.0 content 1991.0 footer 2.0 (total 2295.0)
Reply status: 1xx=0 2xx=210 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.07 system 17.73 (user 21.6% system 75.5% total 97.1%)
Net I/O: 20.6 KB/s (0.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
====== 80 USERS ==========
httperf --client=0/1 --server=www.google.com --port=80 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=240 --num-calls=1
Maximum connect burst length: 1

Total: connections 240 requests 240 replies 240 test-duration 71.238 s

Connection rate: 3.4 conn/s (296.8 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 80.9 avg 296.8 max 3540.6 median 104.5 stddev 734.4
Connection time [ms]: connect 146.5
Connection length [replies/conn]: 1.000

Request rate: 3.4 req/s (296.8 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 0.2 avg 3.2 max 9.2 stddev 2.5 (14 samples)
Reply time [ms]: response 131.9 transfer 18.4
Reply size [B]: header 302.0 content 1991.0 footer 2.0 (total 2295.0)
Reply status: 1xx=0 2xx=240 3xx=0 4xx=0 5xx=0

CPU time [s]: user 16.77 system 52.93 (user 23.5% system 74.3% total 97.8%)
Net I/O: 7.8 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
====== 90 USERS ==========
httperf --client=0/1 --server=www.google.com --port=80 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=270 --num-calls=1
Maximum connect burst length: 1

Total: connections 270 requests 269 replies 269 test-duration 73.399 s

Connection rate: 3.7 conn/s (271.8 ms/conn, <=2 concurrent connections)
Connection time [ms]: min -431.4 avg 261.7 max 3127.5 median 100.5 stddev 669.8
Connection time [ms]: connect 154.7
Connection length [replies/conn]: 1.000

Request rate: 3.7 req/s (272.9 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 1.6 avg 3.8 max 9.6 stddev 2.2 (14 samples)
Reply time [ms]: response 115.8 transfer 1.9
Reply size [B]: header 302.0 content 1991.0 footer 2.0 (total 2295.0)
Reply status: 1xx=0 2xx=269 3xx=0 4xx=0 5xx=0

CPU time [s]: user 15.84 system 55.28 (user 21.6% system 75.3% total 96.9%)
Net I/O: 8.4 KB/s (0.1*10^6 bps)

Errors: total 1 client-timo 0 socket-timo 0 connrefused 1 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

wlan0     Statistics collected:
    00:04:E2:81:69:48 : Quality:253/92  Signal level:-18 dBm  Noise level:-30 dBm (updated)
    00:04:E2:81:A5:E2 : Quality:248/92  Signal level:-20 dBm  Noise level:-30 dBm (updated)
    00:11:24:94:61:5F : Quality:25/92  Signal level:-7 dBm  Noise level:-30 dBm
    typical/average   : Quality:0  Signal level:0  Noise level:0

========================